## 정렬(sort)

 - 데이터 정렬
 
 - 기준
   - 인덱스 => sort_index
   - 값 => sort_value()

In [2]:
# 모듈 로딩
import pandas as pd
import numpy as np       # nan 사용

# 데이터 생성
df=pd.DataFrame({'value':[4,1,2,3,5],
                'name':['Kim','Lee','Park','Choi','Son'],
                'age':[12,np.nan,10,6,np.nan]})

# 데이터 정보 확인
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   value   5 non-null      int64
 1   name    5 non-null      object
 2   age     3 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 248.0+ bytes

In [3]:
# 인덱스 & 컬럼 확인
print(df.index, df.columns, sep='\n')

RangeIndex(start=0, stop=5, step=1)
Index(['value', 'name', 'age'], dtype='object')

In [4]:
# 정렬하기
# [기본] ascending=True : 오름차순 --> ascending=False : 내림차순
df.sort_index(ascending=False)

   value  name   age
4      5   Son   NaN
3      3  Choi   6.0
2      2  Park  10.0
1      1   Lee   NaN
0      4   Kim  12.0

In [5]:
# 틀정 컬럼 기존 저열 => sort_value()
# name 컬럼으로 정렬
df.sort_values(by='name')

   value  name   age
3      3  Choi   6.0
0      4   Kim  12.0
1      1   Lee   NaN
2      2  Park  10.0
4      5   Son   NaN

In [6]:
df.sort_values('name',ascending=False)

   value  name   age
4      5   Son   NaN
2      2  Park  10.0
1      1   Lee   NaN
0      4   Kim  12.0
3      3  Choi   6.0

In [7]:
df.name[0], len(df.name[0])

('Kim', 3)

In [8]:
[len(name) for name in df['name']]

[3, 3, 4, 4, 3]

In [13]:
df['len_name']=[len(name) for name in df['name']]
df.sort_values('len_name',ascending=False)

   value  name   age  len_name
2      2  Park  10.0         4
3      3  Choi   6.0         4
0      4   Kim  12.0         3
1      1   Lee   NaN         3
4      5   Son   NaN         3

In [63]:
f=lambda x: len(df['name'][x])

In [66]:
print(type(f))

<class 'function'>

In [79]:
for x in [0,1,2,3,4]: print(len(df['name'][x]))

3
3
4
4
3

5

In [96]:
# 점심식사후`````````

df.sort_values('name',key=lambda x: df['name'].str.len(),ascending=False)

   value  name   age  len_name
2      2  Park  10.0         4
3      3  Choi   6.0         4
0      4   Kim  12.0         3
1      1   Lee   NaN         3
4      5   Son   NaN         3

# 컬럼명 정렬

In [ ]:
df.columns, type(df.columns), list(df.columns)

In [ ]:
colList=list(df.columns)
colList.sort()
colList

In [ ]:
df2=df[colList]
df2

In [ ]:
df3=df.T
df3

In [ ]:
df3.reset_index(inplace=True)
df3

In [ ]:
df3.sort_values(by='index',inplace=True)

In [ ]:
df3.set_index('index',inplace=True)

In [ ]:
df3.T